bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA64C3.xml
                </instance>
                <instance name="DFLLRC2M">
                    <register-group address-space="data" offset="0x0068" name-in-module="DFLL" name="DFLLRC2M"/>
                </instance>
            </module>
            <module name="RST" id="I6083" version="XMEGAAU">
                <instance name="RST">
                    <register-group address-space="data" offset="0x0078" name-in-module="RST" name="RST"/>
                </instance>
            </module>
            <module name="WDT" id="I6078">
                <instance name="WDT">
                    <register-group address-space="data" offset="0x0080" name-in-module="WDT" name="WDT"/>
                </instance>
            </module>
            <module name="MCU" id="I6091" version="XMEGAD">
                <instance name="MCU">
                    <register-group address-space="data" offset="0x0090" name-in-module="MCU" name="MCU"/>
                </instance>
            </module>
            <module name="PMIC" id="I6057">
                <instance name="PMIC">
                    <register-group address-space="data" offset="0x00A0" name-in-module="PMIC" name="PMIC"/>
                </instance>
            </module>
            <module name="PORTCFG" id="I6075" version="XMEGAD">
                <instance name="PORTCFG">
                    <register-group address-space="data" offset="0x00B0" name-in-module="PORTCFG" name="PORTCFG"/>
                    <signals>
                        <signal field="CLKOUT" function="CLKOUT" group="CLKOUT" pad="PC7"/>
                        <signal field="CLKEVPIN" function="CLKOUT_ALT" group="CLKOUT" pad="PC4"/>
                        <signal field="EVOUT" function="EVOUT" group="EVOUT" pad="PC7"/>
                        <signal field="CLKEVPIN" function="EVOUT_ALT" group="EVOUT" pad="PC4"/>
                        <signal function="RTCOUTC" group="RTCOUT" pad="PC6"/>
                    </signals>
                </instance>
            </module>
            <module name="CRC" id="I6111" version="XMEGAD">
                <instance name="CRC">
                    <register-group address-space="data" offset="0x0D0" name-in-module="CRC" name="CRC"/>
                </instance>
            </module>
            <module name="EVSYS" id="I6061" version="XMEGAC">
                <instance name="EVSYS">
                    <register-group address-space="data" offset="0x0180" name-in-module="EVSYS" name="EVSYS"/>
                </instance>
            </module>
            <module name="NVM" id="I6076" version="XMEGAAU">
                <instance name="NVM">
                    <register-group address-space="data" offset="0x01C0" name-in-module="NVM" name="NVM"/>
                </instance>
            </module>
            <module name="ADC" id="I6110">
                <instance name="ADCA">
                    <register-group address-space="data" offset="0x0200" name-in-module="ADC" name="ADCA"/>
                    <signals>
                        <signal function="ADC" group="ADC" index="0" pad="PA0"/>
                        <signal function="ADC" group="ADC" index="1" pad="PA1"/>
                        <signal function="ADC" group="ADC" index="2" pad="PA2"/>
                        <signal function="ADC" group="ADC" index="3" pad="PA3"/>
                        <signal function="ADC" group="ADC" index="4" pad="PA4"/>
                        <signal function="ADC" group="ADC" index="5" pad="PA5"/>
                        <signal function="ADC" group="ADC" index="6" pad="PA6"/>
                        <signal function="ADC" group="ADC" index="7" pad="PA7"/>
                        <signal function="ADC" group="ADC" index="8" pad="PB0"/>
                        <signal function="ADC" group="ADC" index="9" pad="PB1"/>
                        <signal function="ADC" group="ADC" index="10" pad="PB2"/>
                        <signal function="ADC" group="ADC" index="11" pad="PB3"/>
                        <signal function="ADC" group="ADC" index="12" pad="PB4"/>
                        <signal function="ADC" group="ADC" index="13" pad="PB5"/>
                        <signal function="ADC" group="ADC" index="14" pad="PB6"/>
                        <signal function="ADC" group="ADC" index="15" pad="PB7"/>
                        <signal function="AREF" group="REFA" index="0" pad="PA0"/>
                        <signal function="AREF" group="REFB" index="0" pad="PB0"/>
                    </signals>
                </instance>
            </module>
            <module name="AC" id="I6077" version="XMEGAD">
                <instance name="ACA">
                    <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
                    <signals>
                        <signal function="AC" group="AC" index="0" pad="PA0"/>
                        <signal function="AC" group="AC" index="1" pad="PA1"/>
                        <signal function="AC" group="AC" index="2" pad="PA2"/>
                        <signal function="AC" group="AC" index="3" pad="PA3"/>
                        <signal function="AC" group="AC" index="4" pad="PA4"/>
                        <signal function="AC" group="AC" index="5" pad="PA5"/>
                        <signal function="AC" group="AC" index="6" pad="PA6"/>
                        <signal function="AC" group="AC" index="7" pad="PA7"/>
                        <signal function="ACOUT" group="ACOUT" index="1" pad="PA6"/>
                        <signal function="ACOUT" group="ACOUT" index="0" pad="PA7"/>
                    </signals>
                </instance>
            </module>
            <module name="RTC" id="I6093">
                <instance name="RTC">
                    <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
                </instance>
            </module>
            <module name="TWI" id="I6089" version="XMEGAAU">
                <instance name="TWIC">
                    <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
                    <signals>
                        <signal function="TWI" group="SDA" pad="PC0"/>
                        <signal function="TWI" group="SCL" pad="PC1"/>
                    </signals>
                </instance>
                <instance name="TWIE">
                    <register-group address-space="data" offset="0x4A0" name-in-module="TWI" name="TWIE"/>
                    <signals>
                        <signal function="TWI" group="SDA" pad="PE0"/>
                        <signal function="TWI" group="SCL" pad="PE1"/>
                    </signals>
                </instance>
            </module>
