bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA64C3.xml
        <module name="PORT" id="I6075" version="XMEGAAU" caption="I/O Port Configuration">
            <register-group caption="I/O Ports" name="PORT" size="24">
                <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
                <register caption="I/O Port Data Direction Set" name="DIRSET" offset="0x01" size="1"/>
                <register caption="I/O Port Data Direction Clear" name="DIRCLR" offset="0x02" size="1"/>
                <register caption="I/O Port Data Direction Toggle" name="DIRTGL" offset="0x03" size="1"/>
                <register caption="I/O Port Output" name="OUT" offset="0x04" size="1"/>
                <register caption="I/O Port Output Set" name="OUTSET" offset="0x05" size="1"/>
                <register caption="I/O Port Output Clear" name="OUTCLR" offset="0x06" size="1"/>
                <register caption="I/O Port Output Toggle" name="OUTTGL" offset="0x07" size="1"/>
                <register caption="I/O port Input" name="IN" offset="0x08" size="1"/>
                <register caption="Interrupt Control Register" name="INTCTRL" offset="0x09" size="1">
                    <bitfield caption="Port Interrupt 1 Level" mask="0x0C" name="INT1LVL" values="PORT_INT1LVL"/>
                    <bitfield caption="Port Interrupt 0 Level" mask="0x03" name="INT0LVL" values="PORT_INT0LVL"/>
                </register>
                <register caption="Port Interrupt 0 Mask" name="INT0MASK" offset="0x0A" size="1"/>
                <register caption="Port Interrupt 1 Mask" name="INT1MASK" offset="0x0B" size="1"/>
                <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
                    <bitfield caption="Port Interrupt 1 Flag" mask="0x02" name="INT1IF"/>
                    <bitfield caption="Port Interrupt 0 Flag" mask="0x01" name="INT0IF"/>
                </register>
                <register caption="I/O Port Pin Remap Register" name="REMAP" offset="0x0E" size="1">
                    <bitfield caption="SPI" mask="0x20" name="SPI"/>
                    <bitfield caption="USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Timer/Counter 0 Output Compare D" mask="0x08" name="TC0D"/>
                    <bitfield caption="Timer/Counter 0 Output Compare C" mask="0x04" name="TC0C"/>
                    <bitfield caption="Timer/Counter 0 Output Compare B" mask="0x02" name="TC0B"/>
                    <bitfield caption="Timer/Counter 0 Output Compare A" mask="0x01" name="TC0A"/>
                </register>
                <register caption="Pin 0 Control Register" name="PIN0CTRL" offset="0x10" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 1 Control Register" name="PIN1CTRL" offset="0x11" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 2 Control Register" name="PIN2CTRL" offset="0x12" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 3 Control Register" name="PIN3CTRL" offset="0x13" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 4 Control Register" name="PIN4CTRL" offset="0x14" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 5 Control Register" name="PIN5CTRL" offset="0x15" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 6 Control Register" name="PIN6CTRL" offset="0x16" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 7 Control Register" name="PIN7CTRL" offset="0x17" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
            </register-group>
            <value-group caption="Port Interrupt 0 Level" name="PORT_INT0LVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
