bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA64C3.xml
            <value-group caption="Low Byte Compare C Interrupt Level" name="TC2_LCMPCINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Low Byte Compare B Interrupt Level" name="TC2_LCMPBINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Low Byte Compare A Interrupt Level" name="TC2_LCMPAINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Timer/Counter Command" name="TC2_CMD">
                <value caption="No Command" name="NONE" value="0x00"/>
                <value caption="Force Restart" name="RESTART" value="0x02"/>
                <value caption="Force Hard Reset" name="RESET" value="0x03"/>
            </value-group>
            <value-group caption="Timer/Counter Command" name="TC2_CMDEN">
                <value caption="Low Byte Timer/Counter" name="LOW" value="0x01"/>
                <value caption="High Byte Timer/Counter" name="HIGH" value="0x02"/>
                <value caption="Both Low Byte and High Byte Timer/Counters" name="BOTH" value="0x03"/>
            </value-group>
            <interrupt-group name="TC2">
                <interrupt index="0" name="LUNF" caption="Low Byte Underflow Interrupt"/>
                <interrupt index="1" name="HUNF" caption="High Byte Underflow Interrupt"/>
                <interrupt index="2" name="LCMPA" caption="Low Byte Compare A Interrupt"/>
                <interrupt index="3" name="LCMPB" caption="Low Byte Compare B Interrupt"/>
                <interrupt index="4" name="LCMPC" caption="Low Byte Compare C Interrupt"/>
                <interrupt index="5" name="LCMPD" caption="Low Byte Compare D Interrupt"/>
            </interrupt-group>
        </module>
        <module name="AWEX" id="I6090" version="XMEGAAU" caption="Timer/Counter Advanced Waveform Extension">
            <register-group caption="Advanced Waveform Extension" name="AWEX" size="13">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Pattern Generation Mode" mask="0x20" name="PGM"/>
                    <bitfield caption="Common Waveform Channel Mode" mask="0x10" name="CWCM"/>
                    <bitfield caption="Dead Time Insertion Compare Channel D Enable" mask="0x08" name="DTICCDEN"/>
                    <bitfield caption="Dead Time Insertion Compare Channel C Enable" mask="0x04" name="DTICCCEN"/>
                    <bitfield caption="Dead Time Insertion Compare Channel B Enable" mask="0x02" name="DTICCBEN"/>
                    <bitfield caption="Dead Time Insertion Compare Channel A Enable" mask="0x01" name="DTICCAEN"/>
                </register>
                <register caption="Fault Detection Event Mask" name="FDEMASK" offset="0x02" size="1"/>
                <register caption="Fault Detection Control Register" name="FDCTRL" offset="0x03" size="1">
                    <bitfield caption="Fault Detect on Disable Break Disable" mask="0x10" name="FDDBD"/>
                    <bitfield caption="Fault Detect Mode" mask="0x04" name="FDMODE"/>
                    <bitfield caption="Fault Detect Action" mask="0x03" name="FDACT" values="AWEX_FDACT"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x04" size="1">
                    <bitfield caption="Fault Detect Flag" mask="0x04" name="FDF"/>
                    <bitfield caption="Dead Time High Side Buffer Valid" mask="0x02" name="DTHSBUFV"/>
                    <bitfield caption="Dead Time Low Side Buffer Valid" mask="0x01" name="DTLSBUFV"/>
                </register>
                <register caption="Status Set Register" name="STATUSSET" offset="0x05" size="1">
                    <bitfield caption="Fault Detect Flag" mask="0x04" name="FDF"/>
                    <bitfield caption="Dead Time High Side Buffer Valid" mask="0x02" name="DTHSBUFV"/>
                    <bitfield caption="Dead Time Low Side Buffer Valid" mask="0x01" name="DTLSBUFV"/>
                </register>
                <register caption="Dead Time Both Sides" name="DTBOTH" offset="0x06" size="1"/>
                <register caption="Dead Time Both Sides Buffer" name="DTBOTHBUF" offset="0x07" size="1"/>
                <register caption="Dead Time Low Side" name="DTLS" offset="0x08" size="1"/>
                <register caption="Dead Time High Side" name="DTHS" offset="0x09" size="1"/>
                <register caption="Dead Time Low Side Buffer" name="DTLSBUF" offset="0x0A" size="1"/>
                <register caption="Dead Time High Side Buffer" name="DTHSBUF" offset="0x0B" size="1"/>
                <register caption="Output Override Enable" name="OUTOVEN" offset="0x0C" size="1"/>
            </register-group>
            <value-group caption="Fault Detect Action" name="AWEX_FDACT">
                <value caption="No Fault Protection" name="NONE" value="0x00"/>
                <value caption="Clear Output Enable Bits" name="CLEAROE" value="0x01"/>
                <value caption="Clear I/O Port Direction Bits" name="CLEARDIR" value="0x03"/>
            </value-group>
        </module>
        <module name="HIRES" id="I6090" version="XMEGAAU" caption="Timer/Counter High-Resolution Extension">
            <register-group caption="High-Resolution Extension" name="HIRES" size="1">
                <register caption="Control Register" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="High Resolution Plus" mask="0x04" name="HRPLUS"/>
                    <bitfield caption="High Resolution Enable" mask="0x03" name="HREN" values="HIRES_HREN"/>
                </register>
            </register-group>
            <value-group caption="High Resolution Enable" name="HIRES_HREN">
                <value caption="No Fault Protection" name="NONE" value="0x00"/>
                <value caption="Enable High Resolution on Timer/Counter 0" name="TC0" value="0x01"/>
                <value caption="Enable High Resolution on Timer/Counter 1" name="TC1" value="0x02"/>
                <value caption="Enable High Resolution both Timer/Counters" name="BOTH" value="0x03"/>
            </value-group>
        </module>
        <module name="USART" id="I6090" version="XMEGAAU" caption="Universal Asynchronous Receiver-Transmitter">
            <register-group caption="Universal Synchronous/Asynchronous Receiver/Transmitter" name="USART" size="8">
                <register caption="Data Register" name="DATA" offset="0x00" size="1"/>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Receive Interrupt Flag" mask="0x80" name="RXCIF"/>
                    <bitfield caption="Transmit Interrupt Flag" mask="0x40" name="TXCIF"/>
                    <bitfield caption="Data Register Empty Flag" mask="0x20" name="DREIF"/>
                    <bitfield caption="Frame Error" mask="0x10" name="FERR"/>
                    <bitfield caption="Buffer Overflow" mask="0x08" name="BUFOVF"/>
                    <bitfield caption="Parity Error" mask="0x04" name="PERR"/>
                    <bitfield caption="Receive Bit 8" mask="0x01" name="RXB8"/>
                </register>
                <register caption="Control Register A" name="CTRLA" offset="0x03" size="1">
                    <bitfield caption="Receive Interrupt Level" mask="0x30" name="RXCINTLVL" values="USART_RXCINTLVL"/>
                    <bitfield caption="Transmit Interrupt Level" mask="0x0C" name="TXCINTLVL" values="USART_TXCINTLVL"/>
                    <bitfield caption="Data Register Empty Interrupt Level" mask="0x03" name="DREINTLVL"
                              values="USART_DREINTLVL"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x04" size="1">
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
                    <bitfield caption="Double transmission speed" mask="0x04" name="CLK2X"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x02" name="MPCM"/>
                    <bitfield caption="Transmit bit 8" mask="0x01" name="TXB8"/>
                </register>
                <register caption="Control Register C" name="CTRLC" offset="0x05" size="1">
                    <bitfield caption="Communication Mode" mask="0xC0" name="CMODE" values="USART_CMODE"/>
                    <bitfield caption="Parity Mode" mask="0x30" name="PMODE" values="USART_PMODE"/>
                    <bitfield caption="Stop Bit Mode" mask="0x08" name="SBMODE"/>
                    <bitfield caption="Character Size" mask="0x07" name="CHSIZE" values="USART_CHSIZE"/>
                </register>
                <register caption="Baud Rate Control Register A" name="BAUDCTRLA" offset="0x06" size="1">
                    <bitfield caption="Baud Rate Selection Bits [7:0]" mask="0xFF" name="BSEL"/>
                </register>
                <register caption="Baud Rate Control Register B" name="BAUDCTRLB" offset="0x07" size="1">
                    <bitfield caption="Baud Rate Scale" mask="0xF0" name="BSCALE"/>
                    <bitfield caption="Baud Rate Selection bits[11:8]" mask="0x0F" name="BSEL"/>
                </register>
            </register-group>
            <value-group caption="Receive Complete Interrupt level" name="USART_RXCINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Transmit Complete Interrupt level" name="USART_TXCINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Data Register Empty Interrupt level" name="USART_DREINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Character Size" name="USART_CHSIZE">
                <value caption="Character size: 5 bit" name="5BIT" value="0x00"/>
                <value caption="Character size: 6 bit" name="6BIT" value="0x01"/>
                <value caption="Character size: 7 bit" name="7BIT" value="0x02"/>
                <value caption="Character size: 8 bit" name="8BIT" value="0x03"/>
                <value caption="Character size: 9 bit" name="9BIT" value="0x07"/>
            </value-group>
            <value-group caption="Communication Mode" name="USART_CMODE">
                <value caption="Asynchronous Mode" name="ASYNCHRONOUS" value="0x00"/>
                <value caption="Synchronous Mode" name="SYNCHRONOUS" value="0x01"/>
                <value caption="IrDA Mode" name="IRDA" value="0x02"/>
                <value caption="Master SPI Mode" name="MSPI" value="0x03"/>
            </value-group>
            <value-group caption="Parity Mode" name="USART_PMODE">
                <value caption="No Parity" name="DISABLED" value="0x00"/>
                <value caption="Even Parity" name="EVEN" value="0x02"/>
                <value caption="Odd Parity" name="ODD" value="0x03"/>
            </value-group>
            <interrupt-group name="USART">
                <interrupt index="0" name="RXC" caption="Reception Complete Interrupt"/>
                <interrupt index="1" name="DRE" caption="Data Register Empty Interrupt"/>
                <interrupt index="2" name="TXC" caption="Transmission Complete Interrupt"/>
            </interrupt-group>
        </module>
        <module name="SPI" id="I6090" version="XMEGAAU" caption="Serial Peripheral Interface">
            <register-group caption="Serial Peripheral Interface" name="SPI" size="4">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Enable Double Speed" mask="0x80" name="CLK2X"/>
                    <bitfield caption="Enable Module" mask="0x40" name="ENABLE"/>
                    <bitfield caption="Data Order Setting" mask="0x20" name="DORD"/>
                    <bitfield caption="Master Operation Enable" mask="0x10" name="MASTER"/>
                    <bitfield caption="SPI Mode" mask="0x0C" name="MODE" values="SPI_MODE"/>
                    <bitfield caption="Prescaler" mask="0x03" name="PRESCALER" values="SPI_PRESCALER"/>
                </register>
                <register caption="Interrupt Control Register" name="INTCTRL" offset="0x01" size="1">
                    <bitfield caption="Interrupt level" mask="0x03" name="INTLVL" values="SPI_INTLVL"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x02" size="1">
                    <bitfield caption="Interrupt Flag" mask="0x80" name="IF"/>
                    <bitfield caption="Write Collision" mask="0x40" name="WRCOL"/>
                </register>
                <register caption="Data Register" name="DATA" offset="0x03" size="1"/>
            </register-group>
